import Image from 'next/image';
/* eslint-disable react/no-unescaped-entities */
const OurBlogSection = () => {
  return (
    <section className="bg-gray-50">
      <div className="">
        <div className="flex flex-wrap ">
          {/* Image Section */}
          <div className="w-full  mb-6 lg:mb-0 relative h-[300px] lg:h-[400px]">
            <Image 
              src="/Images/about/about.png" 
              alt="About" 
              fill 
              style={{ objectFit: 'cover' }} 
              priority
            />
          </div>
          
          {/* Text Section with Scroll */}
          <div className="w-full  px-4  ">
            <div className="h-full">
              <h2 className="text-xl md:text-2xl font-semibold mb-4 text-center">महाराजा अग्रसेन जी के संदेश</h2>
              <p className="text-justify indent-5 mb-4">
                महाराजा अग्रसेन जी के संदेश ‘एक ईंट एक रुपया’ को साकार करने की भावना से प्रेरित होकर, हमारा संगठन समाज में सेवा कार्यों के प्रति पूर्णतः समर्पित है।
                यदि किसी अग्रबंधु परिवार के मुख्य पालनकर्ता की असमय मृत्यु हो जाती है और परिवार में छोटे, निर्भर बच्चे हैं, तो ऐसी कठिन परिस्थिति में परिवार को गंभीर आर्थिक संकट का सामना करना पड़ता है।
                जीवन यापन के लिए कोई स्थायी सहारा न होने पर, अग्रबंधु सेवार्थ संस्थान (ABSS) के सभी सदस्य वर्तमान नियमों और ट्रस्ट की नीतियों के अनुसार उस दिवंगत सदस्य के नॉमिनी को आर्थिक सहायता प्रदान करेंगे।
              </p>
              <p className="text-justify indent-5 mb-4">
                संस्था के नियमानुसार, एक पूर्व-निर्धारित सम्मानजनक राशि सभी सदस्यों द्वारा नॉमिनी के बैंक खाते में सीधे हस्तांतरित की जाएगी। यह प्रक्रिया ट्रस्ट द्वारा निर्धारित दिशा-निर्देशों और वित्तीय नियमन के अनुसार होती है, 
                जिससे यह सुनिश्चित किया जाता है कि सहायता पारदर्शी और निष्पक्ष रूप से प्रदान की जाए। इस आर्थिक सहायता से परिवार को जीवन यापन में महत्वपूर्ण योगदान मिलेगा और उनके घर को सुचारू रूप से चलाने में मदद मिलेगी।
              </p>
              <p className="text-justify indent-5 mb-4">
                ट्रस्ट के नियमों के तहत, सहायता राशि के वितरण की प्रक्रिया पारदर्शी ढंग से की जाती है। इसका उद्देश्य उस परिवार को एक सम्मानजनक सहयोग प्रदान कर उन्हें अपने भविष्य की राह पर सशक्त रूप से आगे बढ़ने में मदद करना है। 
                ABSS का मुख्य उद्देश्य ट्रस्ट की नीति के अनुसार परिवारों को उचित और सम्मानजनक सहयोग राशि प्रदान करना है, ताकि वे संकट की घड़ी में आत्मसम्मान के साथ खड़े हो सकें।
              </p>
              
              {/* New Section: अग्रवाल के बारे में */}
              <h2 className="text-xl md:text-2xl font-semibold mb-4 text-center">अग्रवाल के बारे में</h2>
              <p className="text-justify indent-5 mb-4">
                अग्रवाल (Agarwal, Agerwal, Agarwala, Agarwala, Agarwalla, Agrawal, Agrawal or Agarwala) एक क्षत्रिय बनिया समुदाय है।
                अग्रवाल का शाब्दिक अर्थ है "अग्रसेन के बच्चे" या "अग्रोहा के लोग"।
              </p>
              <p className="text-justify indent-5 mb-4">
                यह भी कहा जाता है कि अग्रवाल समाज के संस्थापक, महाराजा अग्रसेन एक क्षत्रिय राजा थे, जो सनातन देवता, भगवान श्री राम के वंशजों में से एक हैं और उनकी प्रमुख देवी माता लक्ष्मी थीं।
                माता लक्ष्मी ने अपनी और भगवान श्री विष्णु की कृपा से राजा और उसके वंशजों को सदैव समृद्ध रहने का वरदान दिया। महाराजा अग्रसेन अग्रोहा साम्राज्य के राजा थे।
              </p>
              <p className="text-justify indent-5 mb-4">
                इस समुदाय को व्यवसाय स्थापित करने वालों में से एक के रूप में भी जाना जाता है। अग्रवाल समुदाय के सदस्य अपने व्यापारिक कौशल के लिए जाने जाते हैं और कई वर्षों से भारत में प्रभावशाली और समृद्ध रहे हैं।
                यहां तक कि आधुनिक तकनीक और ई-कॉमर्स कंपनियों में भी उनका दबदबा कायम है। 2013 में यह बताया गया था कि भारत में ई-कॉमर्स कंपनियों के लिए फंडिंग करने वाली प्रत्येक 100 कंपनियों में से 40 कंपनियों की स्थापना अग्रवालों द्वारा की गई थी।
              </p>
            </div>
          </div>
        </div>
      </div>
    </section>
  );
};

export default OurBlogSection;
